Repository: MarkusHarnusek/Palette-Picker-Development
Catalog: Resources/SaveClassResources/SaveClass.*.resx
Languages: pt

# FileErrMsg
source: The selected file is not a valid palette JSON file.
pt: O arquivo selecionado não é um arquivo JSON de paleta válido.

# FileErrTitle
source: File Error
pt: Erro de arquivo

# FileNotExistErr
source: File does not exist.
pt: O arquivo não existe.

# FileNotJSONErr
source: File is not a JSON file.
pt: O arquivo não é um arquivo JSON.

# FileReadErrMsg
source: Error occurred while extracting JSON save file with following error message:
pt: Ocorreu um erro ao extrair o arquivo de salvamento JSON com a seguinte mensagem de erro:

# FileReadErrTitle
source: File Read Error
pt: Erro de leitura de arquivo

# FolderSelectErrMsg
source: No folder selected
pt: Nenhuma pasta selecionada.

# FolderSelectErrTitle
source: Select Error
pt: Erro de seleção

# JSONNullErr
source: JSON data was null.
pt: Os dados JSON eram nulos.

# SaveErrMsg
source: Error occurred while trying to save file. Path is either empty or does not exist.
pt: Ocorreu um erro ao tentar salvar o arquivo. O caminho está vazio ou não existe.

# SaveErrTitle
source: Save Error
pt: Erro de salvamento

# SelectErrMsg
source: No file selected
pt: Nenhum arquivo selecionado.

# SelectErrTitle
source: Select Error
pt: Erro de seleção

# WrongPairCountErr
source: File does not contain the correct number of value pairs.
pt: O arquivo não contém o número correto de pares de valores.

# FileEmptyErr
source: File is empty.
pt: O arquivo está vazio.

# SelectDialog
source: Select the color palette
pt: Selecione a paleta de cores

# MissingKeyErr
source: Missing key required:
pt: Chave obrigatória ausente:

# SaveDialog
source: Select where to save the palette
pt: Selecione onde salvar a paleta

# ReadingErr
source: Error reading file:
pt: Erro ao ler o arquivo:
